src/main/resources/request/SendSaveAvailabilityRequestMessage.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="http://schemas.consiliumtechnologies.com/services/mobile/2009/03/messaging" xmlns:opt="http://schemas.consiliumtechnologies.com/mobile/2015/05/OptimiseMessages.xsd" xmlns:opt1="http://schemas.consiliumtechnologies.com/mobile/2015/05/OptimiseTypes.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <mes:SendSaveAvailabilityRequestMessage>
            <!--Optional:-->
            <mes:SendMessageRequestInfo>
                <mes:QueueName>?</mes:QueueName>
                <!--Optional:-->
                <mes:CorrelationId>?</mes:CorrelationId>
                <mes:Key>?</mes:Key>
            </mes:SendMessageRequestInfo>
            <!--Optional:-->
            <mes:SaveAvailabilityRequest>
                <opt:ResourceAvailability>
                    <!--Optional:-->
                    <opt1:Identity>
                        <opt1:Reference>?</opt1:Reference>
                    </opt1:Identity>
                    <!--Optional:-->
                    <opt1:World>
                        <opt1:Reference>?</opt1:Reference>
                    </opt1:World>
                    <!--Optional:-->
                    <opt1:SourceWorld>
                        <opt1:Reference>?</opt1:Reference>
                    </opt1:SourceWorld>
                    <opt1:Type>?</opt1:Type>
                    <opt1:ReasonReference>?</opt1:ReasonReference>
                    <opt1:Resource>
                        <opt1:Username>?</opt1:Username>
                    </opt1:Resource>
                    <opt1:Start>?</opt1:Start>
                    <opt1:End>?</opt1:End>
                    <!--Optional:-->
                    <opt1:Description>?</opt1:Description>
                </opt:ResourceAvailability>
            </mes:SaveAvailabilityRequest>
        </mes:SendSaveAvailabilityRequestMessage>
    </soapenv:Body>
</soapenv:Envelope>